fixtures/checkout.json

{
  "checkout": {
    "clone_url": "https://apple.myshopify.com/690933842/checkouts/aa8296288254541a747d50794cee3249/clone",
    "completed_at": null,
    "created_at": "2018-11-06T16:55:39-05:00",
    "currency": "USD",
    "presentment_currency": "USD",
    "customer_id": null,
    "customer_locale": "en",
    "device_id": null,
    "discount_code": null,
    "email": null,
    "legal_notice_url": null,
    "location_id": null,
    "name": "#1066348317",
    "note": "",
    "note_attributes": {},
    "order_id": null,
    "order_status_url": null,
    "order": null,
    "payment_due": "995.00",
    "payment_url": "https://app.local/cardserver/sessions",
    "payments": [],
    "phone": null,
    "shopify_payments_account_id": null,
    "privacy_policy_url": null,
    "refund_policy_url": null,
    "requires_shipping": true,
    "reservation_time_left": 0,
    "reservation_time": null,
    "source_identifier": null,
    "source_name": "755357713",
    "source_url": null,
    "subtotal_price": "995.00",
    "shipping_policy_url": null,
    "tax_exempt": false,
    "taxes_included": false,
    "terms_of_sale_url": null,
    "terms_of_service_url": null,
    "token": "aa8296288254541a747d50794cee3249",
    "total_price": "995.00",
    "total_tax": "0.00",
    "total_line_items_price": "995.00",
    "updated_at": "2018-11-06T16:55:39-05:00",
    "user_id": null,
    "web_url": "https://apple.myshopify.com/690933842/checkouts/aa8296288254541a747d50794cee3249",
    "line_items": [
      {
        "id": "28024e82b40102e993766cf1d8a3942c",
        "key": "28024e82b40102e993766cf1d8a3942c",
        "product_id": 921728736,
        "variant_id": 447654529,
        "sku": "IPOD2009BLACK",
        "vendor": "Apple",
        "title": "IPod Touch 8GB",
        "variant_title": "Black",
        "image_url": "//cdn.shopify.com/s/assets/checkout/product-blank-98d4187c2152136e9fb0587a99dfcce6f6873f3a9f21ea9135ed7f495296090f.png",
        "taxable": true,
        "requires_shipping": true,
        "gift_card": false,
        "price": "199.00",
        "compare_at_price": null,
        "line_price": "995.00",
        "properties": {},
        "quantity": 5,
        "grams": 567,
        "fulfillment_service": "shipwire-app",
        "applied_discounts": []
      }
    ],
    "gift_cards": [],
    "tax_lines": [],
    "tax_manipulations": [],
    "shipping_line": null,
    "shipping_rate": null,
    "shipping_address": null,
    "credit_card": null,
    "billing_address": null,
    "applied_discount": null
  }
}
